micropython/micropython/ports/esp32/boards/DENEYAP_KART_1A_V2/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Deneyap Kart 1A v2"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "DeneyapKart1A_v2"

#define MICROPY_PY_MACHINE_DAC              (0)

#define MICROPY_HW_I2C0_SCL                 (21)
#define MICROPY_HW_I2C0_SDA                 (47)

#define MICROPY_HW_SPI1_MOSI                (39)
#define MICROPY_HW_SPI1_MISO                (40)
#define MICROPY_HW_SPI1_SCK                 (41)
